-- translation for GoldSeintoViVAPackage

local t = {
	["goldseintoviva"] = "圣斗士星矢", 
	["gold"] = "黄金",
	["designer:goldseintoviva"] = "游神ViVA",

--白羊座 穆 3体力
	["aries"] = "穆", 
	["xiufu"] = "修复",
	[":xiufu"] = "出牌阶段，你可以弃一张红桃牌为自己回复一点体力，每阶段限一次；当有角色濒死时，（在求桃之前）你可以弃掉一张红桃手牌，解除其濒死状态并将其体力设为1",
	["@xiufu"] = "你可以弃掉一张红桃牌进行修复",
	["#Xiufu"] = "%from 发动了技能【%arg】，将 %to 的体力设为了 %arg2",
	["jingqiang"] = "晶墙", 
	[":jingqiang"] = "回合结束阶段，你可以指定一名角色，直到你的下个回合开始阶段为止，其他角色与其计算距离时，始终+1",
	["@jq"] = "水晶墙",
	["xingmie"] = "星灭", 
	[":xingmie"] = "限定技，你可以弃三张牌，然后对场上手牌数最少的一名角色造成等于其当前手牌数的伤害",
	["@xm"] = "星灭", 

--金牛座 阿鲁迪巴 4体力
	["taurus"] = "阿鲁迪巴", 
	["haojiao"] = "号角", 
	[":haojiao"] = "回合结束阶段，你可以将你的武将牌翻面，然后视为你对攻击范围内的至多两名角色各使用了一张【杀】；当你受到伤害时，若你的武将牌背面朝上，可以将你的武将牌翻面",
	["@@haojiao"] = "是否发动巨型号角？（会翻面哦~）",

--双子座 撒卡 3体力
	["gemini"] = "撒卡", 
	["huanlong"] = "幻胧",
	[":huanlong"] = "出牌阶段，你可以与一名其他角色拼点。赢者获得双方拼点的牌。若你赢，你可以立即观看该角色的手牌。每阶段限一次",
	["#Huanlong"] = "%from 观看了 %to 的手牌，笑而不语",
	["kongjian"] = "空间", 
	[":kongjian"] = "其他角色每对你造成一次伤害，你可以宣言一种花色，该角色需将一张该花色的手牌置于你的武将牌上称之为“星”，若无法如此做，该角色受到1点无来源伤害",
	["@kongjian"] = "请交出一张 %src 花色的手牌，否则会受到一点伤害",
	["#Kongjian"] = "%from 对 %to 说，交出 %arg，饶你不死~",
	["star"] = "星", 
	["xingbao"] = "星爆", 
	[":xingbao"] = "觉醒技，回合开始阶段，若你的星为3张或者更多时，你须增加1点体力上限，回复1点体力，并永久失去技能“空间”。然后获得所有的星",
	["#XingbaoWake"] = "%from 获得了击碎群星的力量！",

--巨蟹座 迪斯马斯克 4体力
	["cancer"] = "迪斯马斯克", 
	["shiqi"] = "尸气",
	[":shiqi"] = "出牌阶段，你可以弃两张牌并指定任意一名角色和一个出牌阶段以外的阶段，你的回合结束后令该角色立即执行该阶段。每阶段限一次",
	["@shiqi"] = "尸气",
	["#ShiqiEffect"] = "%from 对 %to 使用的技能【%arg】被触发，%to 立即执行 %arg2 阶段",
	["shiqi:start"] = "开始阶段",
	["shiqi:judge"] = "判定阶段",
	["shiqi:draw"] = "摸牌阶段",
	["shiqi:discard"] = "弃牌阶段",
	["shiqi:finish"] = "结束阶段",

--狮子座 艾奥里亚 4体力
	["leo"] = "艾奥里亚",
	["leiguang"] = "雷光", 
	[":leiguang"] = "你可以将你的黑色手牌当【雷杀】使用或打出",

--处女座 沙加 4体力
	["virgo"] = "沙加", 
	["budong"] = "不动", 
	[":budong"] = "回合外，你每失去一张牌可以进行一次判定，并将非黑桃的判定结果正面朝上移出游戏称之为“果”",
	["guo"] = "果",
	["liudao"] = "六道", 
	[":liudao"] = "觉醒技，回合开始阶段，若你的“果”牌不少于6张时，须减去1点体力上限，然后你每次摸牌阶段可以挑选一张“果”加入手牌",
	["#LiudaoWake"] = "%from 睁开双眼，参悟六道轮回与天舞宝轮的极致……",
	["baolun"] = "宝轮", 
	[":baolun"] = "你的觉醒技发动前，体力值比你多的角色计算与你的距离时，始终+X（X为你与该角色的体力差值）；你的觉醒技发动后，出牌阶段，你可以选出等于任意一名角色手牌数的果，令该角色舍弃所有手牌并获得你选定的果",
	["#baolun_distance"] = "宝轮(距离技)", 

--天秤座 童虎 4体力
	["libra"] = "童虎",
	["longba"] = "龙霸",
	[":longba"] = "你每使用【杀】造成一次伤害，可弃掉受到该伤害的角色的一张牌",
	["$Longba"] = "%from 的 %card 被弃掉了",
	["longfei"] = "龙飞",
	[":longfei"] = "觉醒技，回合结束时，若你装备区的装备数量为三件或者更多时，你须回复1点体力或者摸两张牌，然后减1点体力上限，并永久获得技能“龙胆”与“直谏”",
	["longfei:recover"] = "回复1点体力",
	["longfei:draw"] = "摸两张牌",
	["#LongfeiWake"] = "%from 积累了243年的小宇宙在这一刻爆发出来！",

--天蝎座 米罗 4体力
	["scorpio"] = "米罗", 
	["hongzhen"] = "红针",
	[":hongzhen"] = "你可以将你使用或打出的非延时锦囊牌或红色基本牌置于你的武将牌上，称之为“针”。出牌阶段，若你的针中存在点数相同的牌，你可以弃掉其中的一张，视为你使用了【顺手牵羊】。当你的针数量为15或者更多时，你可以弃掉全部的针，对任意一名其他角色造成3点伤害",
	["needle"] = "针",
	["#Hongzhen"] = "%from 获得了一枚 %arg，目前共有 %arg2 枚",

--射手座 艾奥罗斯 4体力
	["sagittarius"] = "艾奥罗斯", 
	["yuanzi"] = "原子",
	[":yuanzi"] = "锁定技，回合开始阶段，比较当前你的攻击范围和体力值，并获得对应技能直到你的下个回合开始：\
若你的攻击范围大于你的体力值，你获得“英姿”；\
若你的攻击范围等于你的体力值，你获得“英魂”；\
若你的攻击范围小于你的体力值，你获得“雷光”（你可以将你的黑色手牌当【雷杀】使用或打出）",

--摩羯座 修罗 4体力
	["capricorn"] = "修罗",
	["shengjian"] = "圣剑",
	[":shengjian"] = "回合开始阶段若你已受伤且损失了X点体力值，可以执行下列两项中的一项，每阶段限一次：\
1.立即视为对与你距离X以内的一名角色使用了一张【杀】；\
2.对与你距离大于X的一名角色使用一张【杀】",
	["@shengjian"] = "你可以立即将手臂化作圣剑攻击！",

--水瓶座 卡妙 3体力
	["aquarius"] = "卡妙",
	["binghuan"] = "冰环",
	[":binghuan"] = "你每受到1点伤害，可以展示牌堆顶的两张牌，若两张牌花色不同，则你将其中一张收入手牌，另一张置于你的武将牌上，称之为“环”",
	["huan"] = "环",
	["$BinghuanCard"] = "%from 翻开的【冰环】牌为 %card",
	["bingjiu"] = "冰柩",
	[":bingjiu"] = "其他角色的回合开始阶段，你可以弃一张环并弃一张与该环花色相同的手牌，然后将任意一名角色当前的所有手牌移出游戏，并防止该角色受到的所有普通伤害直到该回合结束，然后归还其手牌",
	["@bingjiu"] = "你可以点击【冰柩】按钮，选择一张 %src 花色的手牌并指定一个目标，在当前回合结束之前避免目标受到的一切非属性伤害",
	["#Bingjiu"] = "%from 弃掉了 %arg 花色的手牌和 %arg2，保护目标是 %to",
	["#BJProtect"] = "%from 受到【%arg2】保护，避免了 %arg 点无属性伤害",
	["#BingjiuProtectRemove"] = "%from 失去了【%arg】的保护",

--双鱼座 阿布罗狄 3体力
	["pisces"] = "阿布罗狄", 
	["meigui"] = "玫瑰",
	[":meigui"] = "你使用红色【杀】指定了一名角色时（在杀结算前），你可以让目标角色弃一张手牌；你使用黑色【杀】指定了一名角色时（在杀结算前），你可以弃一张手牌，则该【杀】不可被闪避",
	["xuexing"] = "血腥",
	[":xuexing"] = "锁定技，杀死你的角色永久获得技能“崩坏”",

}

local goldstp = {"aries", "taurus", "gemini", "cancer", "leo", "virgo", 
	"libra", "scorpio", "sagittarius", "capricorn", "aquarius", "pisces"}

for _, seintopre in ipairs(goldstp) do
	t["designer:" .. seintopre] = t["designer:goldseintoviva"]
end

return t