-- translation for GreenPackage

return {
	["green"] = "绿包", 

--QUN#05 深远的谋士
	["greenjushou"] = "沮授",
	["designer:greenjushou"] = "日月小辰",
	["cv:greenkongrong"] = "",
	["yuanlv"] = "远虑",
	[":yuanlv"] = "出牌阶段，你可以自减一点体力，令场上除你之外的一名角色失去所有武将技直到其下次行动结束，每阶段限一次",
	["zhongjian"] = "忠谏",
	[":zhongjian"] = "弃牌阶段，你可以选择一名其他角色：直到你下回合开始，该角色发动一次武将技(仅限主动技和非锁定触发技)时，你进行一次判定，若为红色，则该角色获得此判定牌，否则你获得此判定牌",
	["@vy"] = "忠",
	["#Zj_TriggerSkill"] = "%to 即将发动技能【%arg2】，%from 的技能【%arg】生效",
	["#Zj_SkillCard"] = "%to 发动了技能【%arg2】，%from 的技能【%arg】生效",
	
--WU#04 谍战英豪
	["greenkanze"] = "阚泽",
	["designer:greenkanze"] = "天山路",
	["diezhi"] = "谍智",
	[":diezhi"] = "沉睡技，出牌阶段，你可以和任一非主公角色更换身份牌，其他任何角色都不知道你对谁发动了谍智技能，包括被谍智的角色本身，每阶段限一次。任何角色都无法查看谍智后的身份牌，包括你自己。当有角色死亡后，你无法发动本技能直到游戏结束",
	["fengjue"] = "封绝",
	[":fengjue"] = "当有角色在回合外摸牌时，你可以弃掉一张牌，阻止其摸牌操作",
--	["fengjue"] = "封绝",
--	[":fengjue"] = "回合内，指定一名角色，其体力值发生变化时立即复原，直到你下回合开始",

--SHU#07 刚柔并济
	["greenmayunlu"] = "马云禄",
	["designer:greenmayunlu"] = "安岐大小姐",
	["jinguo"] = "巾帼",
	[":jinguo"] = "回合开始阶段，你可以弃一张牌并指定一名角色，直到你的下回合开始，该角色成为【杀】的目标时，需使用【杀】才能抵消",
	["@jinguo"] = "你可以弃一张牌并指定一名角色，该角色获得一个巾帼标记",
	["@jin"] = "巾帼",
	["jinguo-jink"] = "你需要打出一张【闪】，但受到【巾帼】影响，必须打出一张【杀】", 
	["wuqi"] = "武骑",
	[":wuqi"] = "回合外，任一角色进行判定且为红色时，你可以立即摸一张牌并对攻击范围内的一角色使用一张【杀】",
}
