-- translation for GreenPackage

return {
	["green"] = "绿包", 

--QUN#05 深远的谋士
	["greenjushou"] = "沮授",
	["designer:greenjushou"] = "日月小辰",
	["cv:greenkongrong"] = "",
	["yuanlv"] = "远虑",
	[":yuanlv"] = "出牌阶段，你可以自减一点体力，令场上任意一名武将白板一回合，每阶段限一次",
	["zhongjian"] = "忠谏",
	[":zhongjian"] = "弃牌阶段，你可以选择除自己以外的一名角色，该角色获得一个“忠”标记。当该角色发动一次主动武将技时，你可以进行一次判定，若为红色，则该角色获得判定牌，否则你获得判定牌并可选择是否立即使用，直到你下回合开始阶段",
	["@vy"] = "忠",
	
--WU#04 谍战英豪
	["greenkanze"] = "阚泽",
	["diezhi"] = "谍智",
	[":diezhi"] = "当有角色在回合外摸牌时，你可以弃掉一张牌，阻止其摸牌操作",
	["fengjue"] = "封绝",
	[":fengjue"] = "回合内，指定一名角色，其体力值发生变化时立即复原，直到你下回合开始",
}
