-- translation for FanchengScenario

return {
	["lixianji"] = "李献计",
	["LiXianJipackage"] = "李献计",
	
	["XJzhonghui"] = "年少异才-钟会",
	["XJzhenggong"] = "争功",
	[":XJzhenggong"] = "当除你之外任意一名角色受到【杀】造成的一次伤害时，你可以弃一张牌并令该角色进行一次判定，若判定结果为♠或♣，则你可以抽取除你之外任意一名角色一张手牌。若判定结果为♦或♥，则你可以摸一张牌。",
	
	["XJcaozhi"] = "八斗之才-曹植",
	["XJwencai"] = "文采",
	[":XJwencai"] = "当♥或♦判定牌进入弃牌堆时，你可以立即获得它。",
	["xjfengliu"] = "风流",
	[":xjfengliu"] = "你每受到一次伤害，可进行一次判定，若结果为♣或♠，你可立即令任意一名角色摸两张牌。",
	["@xjfengliu"] = "请指定【风流】的对象",
	
	
	["XJliuxie"] = "汉献帝-刘协",
	["XJzhaoling"] = "诏令",
	[":XJzhaoling"] = "锁定技，你对指定角色的属性【杀】不可被闪避，结算完时你从该角色的手里抽取一张牌。",
	["XJhanwei"] = "汉威",
	[":XJhanwei"] = "锁定技，黑色的普通【杀】和【南蛮入侵】对你无效。",
	
	["XJpanzhang"] = "贪奢骄横-潘璋",
	["XJjielve"] = "劫掠",
	[":XJjielve"] = "当你使用【过河拆桥】或【顺手牵羊】时，（在它结算之前）你可以对任意一名角色造成1点伤害。每回合限1次。",
	
	["XJlingtong"] = "轻财重义-凌统",
	["XJyifen"] = "义愤",
	[":XJyifen"] = "你的回合外，每当你失去任意一张装备区或判定区里的牌时，你可以对任意一名其他角色造成1点伤害。",
	
	["XJjiangwei"] = "胆大如斗-姜维",
	["XJduwu"] = "黩武",
	[":XJduwu"] = "摸牌阶段，若你已受伤，你可以放弃摸牌并展示牌堆顶的X张牌，X为你已损失的体力值，弃掉其中♠或♣牌，其余牌收入手牌，若弃掉X张♠或♣牌，视为对至多X名角色使用了一张【杀】，然后依次结算之。",
}
