-- translation for LiXianJiPackage

return {
	["OEtanb"] = "坛包B",
	
	["edado"] = "edado",
	["guayan"] = "寡言",
	[":guayan"] = "回合开始阶段，你可进行一次判定：\
  若为红桃，你回复1点体力；\
  若为黑桃，获得【天义】拼点胜利效果直至回合结束；\
  若为方片，你可和任意一名角色拼点，若你赢，你抽取该角色一半手牌（向上取整）；\
  若为梅花，你获得【裸衣】效果直至回合结束。\
  然后将判定牌放在你的武将牌上（移出游戏）",
	["nitai"] = "拟态",
	[":nitai"] = "觉醒技，回合开始阶段，若你拥有三张同花色【寡言】牌，须减1点体力上限，并永久获得技能【天妒】【MOD】",
	["#NitaiWake"] = "%from 的觉醒技【拟态】被触发，减1点体力上限并获得技能【天妒】【MOD】",
		
	["tianyin"] = "天音",
	["skydao"] = "天道",
	[":skydao"] = "锁定技，回合外你每受到1点伤害增加1点体力上限。",
	["#SkydaoMAXHP"] = "%from 的锁定技【天道】被触发，增加1点体力上限",
	["noqing"] = "无情",
	[":noqing"] = "锁定技，你受到伤害时，若你的体力是全场最少或同时为最少，则所有人必须失去1点体力或1点体力上限",
	["#NoqingLoseHp"] = "%to 受到 %from 的锁定技【无情】影响，流失了1点体力",
	["#NoqingLoseMaxHp"] = "%to 受到 %from 的锁定技【无情】影响，流失了1点体力上限",
		
	["jujuzu"] = "猴子",
	["tuiyin"] = "消失",
	[":tuiyin"] = "你可以弃一张手牌来跳过自己的出牌阶段和弃牌阶段。若如此做，获得一个【退隐】标记。",
	["chuxian"] = "出现",
	[":chuxian"] = "觉醒技，回合开始阶段，若你拥有3个或以上的【退隐】标记，须减1点体力上限，并永久获得技能【指引】",
	["#ChuxianWake"] = "%from 的觉醒技【拟态】被触发，减1点体力上限并获得技能【指引】",
	["zhiyin"] = "指引",
	[":zhiyin"] = "回合结束阶段，可弃一个【退隐】标记令任意一名其他角色进行一个额外的回合。",
	["#Zhiyin"] = "%from 使用了技能【指引】, %to 将获得一个额外的回合",
	
	["designer:edado"] = "edado",
	["designer:tianyin"] = "宇文天启",
	["designer:jujuzu"] = "jujuzu",
}
