-- translation for StandardPackage

return {
	["standard_cards"] = "标准卡牌包",
	["standard"] = "标准版",

	["45s"] = "事务所",

	["conan"] = "江户川柯南",
	["zhizhi"] = "直指",
	[":zhizhi"] = "柯南的指控总能正中要害，进行指控时，对方需要进行两次辩护。",

	["ran"] = "毛利兰",
	["lingxi"] = "灵犀",
	[":lingxi"] = "每到山穷水尽时，毛利兰都能想出办法，当没有手卡时自动抽一张卡。",

	["ai"] = "灰原哀",
	["shensi"] = "深思",
	[":shensi"] = "灰原哀的思考比一般人更加缜密，但因此更容易被怀疑，每次抽卡步骤抽四张卡，但得到三个罪证就会出局。",

	["heiji"] = "服部平次",
	["jizhi"] = "急智",
	[":jizhi"] = "在危险时刻，服部平次总会爆发出惊人的智慧，抽卡步骤每得到一个罪证就可以多抽一张卡。",

	["kazuha"] = "远山和叶",
	["jianchi"] = "坚持",
	[":jianchi"] = "远山和叶始终坚持着自己的想法，手卡上限没有限制。",

	["sonoko"] = "铃木园子",
	["kaituo"] = "开脱",
	[":kaituo"] = "铃木园子会不惜口舌来脱罪。可以丢弃两张手卡，去除一个罪证。",

	["hiroshi"] = "阿笠博士",
	["boxue"] = "博学",
	[":boxue"] = "阿笠博士有着丰富的知识，每次行动结束时自动抽卡到使自己出局所需要的罪证数目。",

	["tanteitan"] = "少年侦探队",
	["tongqing"] = "同情",
	[":tongqing"] = "少年侦探队有着强烈的同情心，当有人即将出局时，可以丢弃一张辩护或者巧辩来去除出局者的一个罪证，然后抽相当于此次游戏本技能使用次数的卡，但抽卡数不得超过在场人数。",

	["kogorou"] = "毛利小五郎",
	["weiya"] = "威压",
	[":weiya"] = "毛利小五郎独特的气质能够威慑对手，在使其他人得到罪证时，对方随机丢弃一张手卡。",

	["takagi"] = "高木涉",
	["zhengzhi"] = "正直",
	[":zhengzhi"] = "高木涉一直保持着正直的形象，得到五个罪证才会出局。",

	["sato"] = "佐藤美和子",
	["checha"] = "彻查",
	[":checha"] = "即使是已经出局的人佐藤美和子依然要进行调查，每次有人出局，抽两张卡。",

	["meguri"] = "目暮十三",
	["tiemian"] = "铁面",
	[":tiemian"] = "目暮十三在被怀疑时会作出有力的回应，得到罪证时，如果自己的罪证多于造成罪证者，可以丢弃一张手卡让对方也得到一个罪证。",

	["akai"] = "赤井秀一",
	["zhuisuo"] = "追索",
	[":zhuisuo"] = "不找出凶手，赤井秀一决不会停止，不受一回合只能指控一次的限制。",

	["jodie"] = "朱蒂",
	["fanjie"] = "反诘",
	[":fanjie"] = "朱蒂擅长以其人之道还治其人之身，当自己得到罪证时，将带来罪证的那些卡加入自己的手卡。",

	["gin"] = "琴酒",
	["gouxian"] = "构陷",
	[":gouxian"] = "琴酒经常通过编造证据来攻击对手，可以把任意手卡当作指控使用。",

	["vodka"] = "伏特加",
	["shexian"] = "涉险",
	[":shexian"] = "伏特加往往会冒着危险调查，可以抽三张卡同时得到一个罪证，一回合一次。",
}